Documents/УстановкаСкидок.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Document>
		<Properties>
			<Name>УстановкаСкидок</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.ДействиеСкидок</xr:Item>
				<xr:Item>InformationRegister.РазмерыСкидок</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВидСкидки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыСкидок</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачалаНакопленияСкидки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачалаСкидки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончанияНакопленияСкидки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончанияСкидки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>Любая дополнительная информация</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Получатель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Клиенты</v8:Type>
						<v8:Type>cfg:CatalogRef.КартыСкидок</v8:Type>
						<v8:Type>cfg:CatalogRef.ВидыКартСкидок</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПоВсемФилиалам</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Филиалы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Филиал</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Филиалы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

InformationRegisters/ДействиеСкидок.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>ДействиеСкидок</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>удалитьДатаНачалаДействия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>удалитьДатаОкончанияДействия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ВидСкидки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыСкидок</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Получатель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Клиенты</v8:Type>
						<v8:Type>cfg:CatalogRef.КартыСкидок</v8:Type>
						<v8:Type>cfg:CatalogRef.ВидыКартСкидок</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Филиал</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Филиалы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДатаНачалаДействия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДатаОкончанияДействия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/РазмерыСкидок.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>РазмерыСкидок</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ПроцентСкидки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>КонецИнтервала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Накопительная</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПоДнямНедели</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Фильтр</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Клиенты</v8:Type>
						<v8:Type>cfg:CatalogRef.КартыСкидок</v8:Type>
						<v8:Type>cfg:CatalogRef.ВидыКартСкидок</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/ТипыСкидок.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>ТипыСкидок</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Бонусы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НакопительнаяСкидка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Скидка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Купоны</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ВидПолучателя.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>ВидПолучателя</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ВсеКлиенты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВидКартыСкидок</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КартаСкидок</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Клиенты</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/УстановкаСкидок/Ext/ObjectModule.bsl
#Область ПрограммныйИнтерфейс

// Истина, если это накопительная скидка.
//
// Возвращаемое значение:
//  Булево.
//
Функция ТипСкидкиНакопления() Экспорт 
	
	ПВА = Перечисления.ТипыСкидок;
	Возврат ВидСкидки.ТипСкидки = ПВА.Бонусы Или ВидСкидки.ТипСкидки = ПВА.НакопительнаяСкидка;
	
КонецФункции

// Истина, если это бонусная скидка.
//
// Возвращаемое значение:
//  Булево.
//
Функция ТипСкидкиИмеетРазмерНакопления() Экспорт
	
	ПВА = Перечисления.ТипыСкидок;
	Возврат ВидСкидки.ТипСкидки = ПВА.Бонусы;
	
КонецФункции

#КонецОбласти

#Область ОбработчикиСобытий

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Перем Заголовок;
	
	Заголовок = НСтр("ru='Проведение документа'") + " """ + СокрЛП(Ссылка) + """: ";
	
	СтруктураШапкиДокумента = ОбщегоНазначения.СформироватьСтруктуруШапкиДокумента(ЭтотОбъект);
	
	// Укажем, что надо проверить:
	СтруктураОбязательныхПолей = Новый Структура("ВидСкидки");
	ПроведениеДокументов.ПроверитьЗаполнениеШапкиДокумента(ЭтотОбъект, СтруктураОбязательныхПолей, Отказ, Заголовок);
	
	// Движения действия скидок
	Если ПоВсемФилиалам Тогда
		ДобавитьДвижениеДействияСкидок(Справочники.Филиалы.ПустаяСсылка())
	Иначе
		Для Каждого ФилиалСкидки Из Филиалы Цикл
			ДобавитьДвижениеДействияСкидок(ФилиалСкидки.Филиал);
		КонецЦикла;
	КонецЕсли;
	Движения.ДействиеСкидок.Записать();
	// Добавлено Макеев (
	Движения.РазмерыСкидок.Записывать = Истина;
	Если ТипЗнч(Получатель) = Тип("СправочникСсылка.ВидыКартСкидок") Тогда
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
		               |	МАКСИМУМ(ВидыСкидокРазмерыСкидки.Размер) КАК Размер,
		               |	ВидыСкидокРазмерыСкидки.Ссылка КАК Ссылка
		               |ИЗ
		               |	Справочник.ВидыСкидок.РазмерыСкидки КАК ВидыСкидокРазмерыСкидки
		               |ГДЕ
		               |	ВидыСкидокРазмерыСкидки.Ссылка = &ВидСкидки
		               |
		               |СГРУППИРОВАТЬ ПО
		               |	ВидыСкидокРазмерыСкидки.Ссылка";
		Запрос.УстановитьПараметр("ВидСкидки", ВидСкидки);
		РезультатЗапроса = Запрос.Выполнить();
		Если Не РезультатЗапроса.Пустой() Тогда
			Выборка = РезультатЗапроса.Выбрать();
			Пока Выборка.Следующий() Цикл
				Запись = Движения.РазмерыСкидок.Добавить();
				Запись.Период = Дата;
				Запись.Фильтр = Получатель;
				Запись.ПроцентСкидки = Выборка.Размер;
				Если ЗначениеЗаполнено(ДатаОкончанияСкидки) Тогда
					Запись.КонецИнтервала = ДатаОкончанияСкидки;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;
	// )
	ОбновитьПовторноИспользуемыеЗначения();
	
КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ)
	ОбновитьПовторноИспользуемыеЗначения();
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Если ВидСкидки.ВидПолучателя <> Перечисления.ВидПолучателя.ВсеКлиенты Тогда
		ПроверяемыеРеквизиты.Добавить("Получатель");
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ДобавитьДвижениеДействияСкидок(Филиал)
	
	Если ЕстьПересечениеСкидок(ВидСкидки, Получатель, Филиал) Тогда  
	КонецЕсли;
	
	Запись = Движения.ДействиеСкидок.Добавить();
	Запись.Период	 	= НачалоДня(Дата);
	Запись.Регистратор	= Ссылка;
	Запись.ВидСкидки	= ВидСкидки;
	Запись.Получатель = Получатель;
	Запись.ДатаНачалаДействия = ДатаНачалаСкидки;
	Запись.ДатаОкончанияДействия = ДатаОкончанияСкидки;
	Запись.Филиал = Филиал;
	
КонецПроцедуры

Функция ЕстьПересечениеСкидок(ВидСкидки, Получатель, Филиал)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ДействиеСкидок.НомерСтроки,
	|	ДействиеСкидок.ДатаНачалаДействия,
	|	ДействиеСкидок.ДатаОкончанияДействия
	|ИЗ
	|	РегистрСведений.ДействиеСкидок КАК ДействиеСкидок
	|ГДЕ
	|	ДействиеСкидок.Филиал = &Филиал
	|	И ДействиеСкидок.Получатель = &Получатель
	|	И ДействиеСкидок.ВидСкидки = &ВидСкидки
	|	И (ДействиеСкидок.ДатаНачалаДействия <= &ДатаОкончания
	|				И ДействиеСкидок.ДатаНачалаДействия >= &ДатаНачала
	|			ИЛИ ДействиеСкидок.ДатаОкончанияДействия >= &ДатаНачала
	|				И ДействиеСкидок.ДатаОкончанияДействия <= &ДатаОкончания
	|			ИЛИ ДействиеСкидок.ДатаНачалаДействия <= &ДатаНачала
	|				И ДействиеСкидок.ДатаОкончанияДействия >= &ДатаОкончания)";
	
	Запрос.УстановитьПараметр("ВидСкидки", ВидСкидки);
	Запрос.УстановитьПараметр("ДатаНачала", ДатаНачалаСкидки);
	Запрос.УстановитьПараметр("ДатаОкончания", ДатаОкончанияСкидки);
	Запрос.УстановитьПараметр("Получатель", Получатель);
	Если Филиал = Неопределено Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст,"ДействиеСкидок.Филиал = &Филиал
												|	И","");	
	Иначе
		Запрос.УстановитьПараметр("Филиал", Филиал);
	КонецЕсли;
	
	Результат = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = Результат.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Количество() > 0 Тогда
		
		ВыборкаДетальныеЗаписи.Сбросить();
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл 
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
				СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
					НСтр("ru='Филиал %1: обнаружено пересечение периодов действия скидок. 
							|Найдена скидка ""%2"" для получателя ""%3"" с %4 по %5'"),
					Филиал,
					ВидСкидки,
					Получатель,
					Формат(ВыборкаДетальныеЗаписи.ДатаНачалаДействия, "ДФ=dd.MM.yyyy"),
					Формат(ВыборкаДетальныеЗаписи.ДатаОкончанияДействия, "ДФ=dd.MM.yyyy"))
				); 
		КонецЦикла;	
		
		Возврат Истина;
		
	КонецЕсли;
	
	Возврат Ложь;
	
КонецФункции	

#КонецОбласти
